print('Выберите операцию:')
print('1-"r"-применить унарный минус к операнду')
print('2-"+"-сложение')
print('3-"-"-вычитание')
print('4-"/"-деление')
print('5-"*"-умножение')
print('6-"%"-деление по модулю')
print('7-"<"-минимальное из двух значений')
print('8-">"-максимальное из двух значений')
a = int(input('Введите цифру: '))
b = int(input('Введите первое число: '))
c = int(input('Введите второе число: '))

# Не совсем понял как применять значение унарного минуса к операндам.
# Назначить переменным b и c унарный минус b = -b  c = -c при вводе a = 12,112,102,
# чтобы это значило как -b+с,-b+(-c),b+(-c),и потом создать условия.

if a == 1:
    b = -b
    c = -c
    print(b, c)

if a == 2:
    print('Результат:', b + c)
if a == 3:
    print('Результат:', b - c)
if a == 4:
    if c == 0:
        print('На', c, 'делить нельзя')
    else:
        print('Результат:', b // c)

if a == 5:
    print('Результат:', b * c)
if a == 6:
    print('Результат:', b % c)
if a == 7:
    if b < c:
        print('Результат:', b)
    else:
        print('Результат:', c)
if a == 8:
    if b > c:
        print('Результат:', b)
    else:
        print('Результат:', b)






