def binary(arg):
    '''
    Функция преобразовывает число из десятичной системы в двоичную систему счисления.

    Функция преобразовывает число заданное пользователем из десятичной системы в двоичную систему счисления.

    :param arg: положительное число, введённое пользователем
    :return: положительное число, преобразованное в двоичную систему счисления из десятичной
    '''
    global s
    s = ''
    while arg > 0:
        s = str(arg % 2) + s
        arg = arg // 2
    print(s)


while True:
    d = int(input('->'))
    if d != 0:
        binary(d)
    elif d == 0:
        print('До свидания')
        break


def binary(args):
    '''
    Функция преобразовывает число из десятичной системы в двоичную систему счисления.

    Функция преобразовывает число заданное пользователем из десятичной системы в двоичную систему счисления.

    :param args: положительное число, введённое пользователем.
    :return:положительное число, преобразованное в двоичную систему счисления
    '''
    e = bin(args)
    e = str(e)
    return e[2:]


while True:
    d = int(input('->'))
    if d != 0:
        print(binary(d))
    elif d == 0:
        break