def print_picnic(items_dict, left_width, right_width):
    '''
    Функция принимает словарь и выводит в консоль в виде столбца ключи и значения

    Функция принимает в качестве параметров три аргумента один из них словарь, а два следующих аргумента
    числовые значения, которые отодвигают ключ и значения по строке влево и вправо. Тем самым выводится в консоли
    равномерный столбик из ключей и значений при помощи цикла и заданных аргументов.
    Также функция выводит заголовок ровно по центру строкового столба.

    :param items_dict: принимаемый словарь.
    :param left_width: заданное значение, которое отодвигает строковый элемент влево.
    :param right_width: заданное значение, которое отодвигает строковый элемент вправо.
    :return: выводит в консоль заголовок, затем выводит все ключи и значения по центру строкового столба.
   '''
    print('PICNIC ITEMS'.center(left_width + right_width, '-'))
    for k, v in items_dict.items():
        print(k.ljust(left_width, '.') + str(v).rjust(right_width))


picnic_items = {'sandwiches': 4, 'apples': 12, 'cups': 4, 'cookies': 8000}

print_picnic(picnic_items, 30, 12)
print_picnic(picnic_items, 20, 8)

