import re

# Такси, 2 буквы, 3 цифры, 2 или 3 цифры
# Автомобиль, 1 буква, 3 цифры, 2 буквы, 2 или 3 цифры
# Определить корректность номеров автомобиля

str1 = 'С227НА777 КУ22777 Т22В7477 М227К19У9'

reg = r'[А-Я]{2}[\d]{3}[\d{2}|\d{3}]'
print('Taxi ', re.findall(reg, str1))

reg1 = r'[А-Я][\d]{3}[А-Я]{2}[\d{2}|\d{3}]'
print('Auto ', re.findall(reg1, str1))

# На вход даётся текст посчитайте количество слов

str2 = '''
    Он --- серо-буро-малиновый мяч!
    >>>: ->
    А не кот.
    www.kot.ru
'''

lst = re.findall(r'[\w+?][\w+-]+', str2, flags=re.MULTILINE)
print(len(lst))

# Поиск email

str3 = '''
    Иван Иванович!
    Нужен ответ на письмо от ivanoff@ivan-chai.ru.
    Не забудьте поставить в копию
    serge'o-lupin@mail.ru- это важно.
'''
print(re.findall(r'\w+\'?\w+-?\w+@\w+-?\w+?\.\w+', str3, flags=re.MULTILINE))

str4 = '''
    NO: foo.@ya.ru, foo@ya.ru
    PARTLY: boo@ya.ru, -boo@ya.ru-, foo№boo@ya.ru
'''

print(re.findall(r'[-\w+]+@\w+\.?-?\w+', str4, flags=re.MULTILINE))

# Заменить 09:00  09:00:01 на 'dbt'

str5 = '''
    Уважаемые! Если вы к 09:00 не вернёте 
чемодан, то уже в 09:00:01 я за себя не отвечаю. 
PS. С отношением 25:50 всё нормально!
'''
print(re.sub(r'(\d{2}:\d{2}:\d{2}|\d{2}:\d{2})', r'dbt', str5, count=2))

# Найти аббревиатуры, если идут в строке подряд значит это одна аббревиатура

str6 = '''
Это курс информатики соответствует ФГОС и ПООП, 
это подтверждено ФГУ ФНЦ НИИСИ РАН'
'''

print(re.findall(r'[?:\w+][А-Я]+[?:\w+]|[?<!\s][А-Я\s]+', str6, flags=re.MULTILINE))

