from random import randint


def number():  # аргумент nums число попыток угадывание
    cnt = int(input('Введите количество попыток с которых угадаете число'))
    c = ' '  # инициализация переменной для выхода из игры
    b = 1  # инициализация переменной командного ввода (число которое пользователь вводит для угадывания)
    while True:  # бесконечный цикл, с генерацией случайного числа, которое будет угадываться игроком
        count = 0  # инициализация счётчика попыток
        c = input('Начнём игру ?')
        if c == '0':  # условие для выбора для начала игры или выхода
            print('Спасибо за посещение')
            break
        else:
            num = randint(1, 20)  # случайное число

            print('случайное число выбрано')
            print(cnt)
            while b != 0:  # цикл проверки загаданного числа
                b = int(input('Введите число'))  # число вводимое игроком
                count += 1
                print(count)
                if count == cnt:  # если число угадываний совпадает с числом попыток, то происходит выход из цикла
                    print(f'Вы не угадали число за {count} попыток')
                    break
                if b == num:  # выход из цикла если число загаданное, совпадает с числом введённым игроком
                    print(f'Вы угадали число за {count} попыток')
                    break
                else:  # если пользователь не угадал число возвращение в начало цикла
                    print(f'Повторите попытку, число {b} неверное')



number()
