print('Найти произведение пятизначного числа, и его среднее арифметическое.')
a = int(input('Введите пятизначное число: '))

b = a % 10
c = (a % 100)//10
d = (a % 1000)//100
e = (a // 1000) % 10
f = a // 10000
res = b * c * d * e * f
res_sum = (b + c + d + e + f)/5
print('Произведение цифр числа ' + str(a) + ':' + ' ' + str(res))
print('Среднее арифметическое:', res_sum)


print('Проверить является ли число чётное.')
check = int(input('Введите чётное число:'))
if check % 2 == 0:
    print('Число', check, 'чётное')
else:
    print('Число', check, 'нечётное')





