
print(' "УГАДАЙ ЧИСЛО" ')
i = 1
hidden = 6
b = ''
while True:
    if i == 1 or i % 10 == 1:
        b = 'попытку'
    elif 2 <= i <= 4 or i % 10 == 2 or i % 10 == 3 or i % 10 == 4:
        b = 'попытки'
    else:
        b = 'попыток'
    a = int(input('Введите число от 1 до 100: '))
    if a == 0:
        print('\nСпасибо за игру, возвращайтесь когда будет скучно.')
        break
    if a < hidden:
        print('Число', a, 'меньше загаданного')
        i += 1
    if a > hidden:
        print('Число', a, 'больше загаданного')
        i += 1
    if a == hidden:
        print('Вы угадали, загаданное число', a, 'и угадали за', i, b)
        print('Если не хотите продолжить игру введите цифру "0"')


